yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/adc_reg.h
#define ADC_CTL_MST_Pos                  (8)                                               /*!< ADC_T::CTL: MST Position               */
#define ADC_CTL_MST_Msk                  (0x1ul << ADC_CTL_MST_Pos)                        /*!< ADC_T::CTL: MST Mask                   */

#define ADC_CTL_PEDE_EN_Pos              (9)                                               /*!< ADC_T::CTL: PEDE_EN Position           */
#define ADC_CTL_PEDE_EN_Msk              (0x1ul << ADC_CTL_PEDE_EN_Pos)                    /*!< ADC_T::CTL: PEDE_EN Mask               */

#define ADC_CTL_WKT_EN_Pos               (11)                                              /*!< ADC_T::CTL: WKT_EN Position            */
#define ADC_CTL_WKT_EN_Msk               (0x1ul << ADC_CTL_WKT_EN_Pos)                     /*!< ADC_T::CTL: WKT_EN Mask                */

#define ADC_CTL_WMSWCH_Pos               (16)                                              /*!< ADC_T::CTL: WMSWCH Position            */
#define ADC_CTL_WMSWCH_Msk               (0x1ul << ADC_CTL_WMSWCH_Pos)                     /*!< ADC_T::CTL: WMSWCH Mask                */

#define ADC_CONF_T_EN_Pos                (0)                                               /*!< ADC_T::CONF: T_EN Position             */
#define ADC_CONF_T_EN_Msk                (0x1ul << ADC_CONF_T_EN_Pos)                      /*!< ADC_T::CONF: T_EN Mask                 */

#define ADC_CONF_Z_EN_Pos                (1)                                               /*!< ADC_T::CONF: Z_EN Position             */
#define ADC_CONF_Z_EN_Msk                (0x1ul << ADC_CONF_Z_EN_Pos)                      /*!< ADC_T::CONF: Z_EN Mask                 */

#define ADC_CONF_NAC_EN_Pos              (2)                                               /*!< ADC_T::CONF: NAC_EN Position           */
#define ADC_CONF_NAC_EN_Msk              (0x1ul << ADC_CONF_NAC_EN_Pos)                    /*!< ADC_T::CONF: NAC_EN Mask               */

#define ADC_CONF_REFSEL_Pos              (6)                                               /*!< ADC_T::CONF: REFSEL Position           */
#define ADC_CONF_REFSEL_Msk              (0x3ul << ADC_CONF_REFSEL_Pos)                    /*!< ADC_T::CONF: REFSEL Mask               */

#define ADC_CONF_CHSEL_Pos               (12)                                              /*!< ADC_T::CONF: CHSEL Position            */
#define ADC_CONF_CHSEL_Msk               (0xful << ADC_CONF_CHSEL_Pos)                     /*!< ADC_T::CONF: CHSEL Mask                */

#define ADC_CONF_REFCNT_Pos              (16)                                              /*!< ADC_T::CONF: REFCNT Position           */
#define ADC_CONF_REFCNT_Msk              (0xful << ADC_CONF_REFCNT_Pos)                    /*!< ADC_T::CONF: REFCNT Mask               */

#define ADC_CONF_TMAVEN_Pos              (20)                                              /*!< ADC_T::CONF: TMAVEN Position           */
#define ADC_CONF_TMAVEN_Msk              (0x1ul << ADC_CONF_TMAVEN_Pos)                    /*!< ADC_T::CONF: TMAVEN Mask               */

#define ADC_CONF_ZMAVEN_Pos              (21)                                              /*!< ADC_T::CONF: ZMAVEN Position           */
#define ADC_CONF_ZMAVEN_Msk              (0x1ul << ADC_CONF_ZMAVEN_Pos)                    /*!< ADC_T::CONF: ZMAVEN Mask               */

#define ADC_CONF_HSPEED_Pos              (22)                                              /*!< ADC_T::CONF: HSPEED Position           */
#define ADC_CONF_HSPEED_Msk              (0x1ul << ADC_CONF_HSPEED_Pos)                    /*!< ADC_T::CONF: HSPEED Mask               */

#define ADC_CONF_SAMPCNT_Pos             (24)                                              /*!< ADC_T::CONF: SAMPCNT Position          */
#define ADC_CONF_SAMPCNT_Msk             (0xfful << ADC_CONF_SAMPCNT_Pos)                  /*!< ADC_T::CONF: SAMPCNT Mask              */

#define ADC_IER_M_IEN_Pos                (0)                                               /*!< ADC_T::IER: M_IEN Position             */
#define ADC_IER_M_IEN_Msk                (0x1ul << ADC_IER_M_IEN_Pos)                      /*!< ADC_T::IER: M_IEN Mask                 */

#define ADC_IER_PEDE_IEN_Pos             (2)                                               /*!< ADC_T::IER: PEDE_IEN Position          */
#define ADC_IER_PEDE_IEN_Msk             (0x1ul << ADC_IER_PEDE_IEN_Pos)                   /*!< ADC_T::IER: PEDE_IEN Mask              */

#define ADC_IER_WKT_IEN_Pos              (3)                                               /*!< ADC_T::IER: WKT_IEN Position           */
#define ADC_IER_WKT_IEN_Msk              (0x1ul << ADC_IER_WKT_IEN_Pos)                    /*!< ADC_T::IER: WKT_IEN Mask               */

#define ADC_IER_PEUE_IEN_Pos             (6)                                               /*!< ADC_T::IER: PEUE_IEN Position          */
#define ADC_IER_PEUE_IEN_Msk             (0x1ul << ADC_IER_PEUE_IEN_Pos)                   /*!< ADC_T::IER: PEUE_IEN Mask              */

#define ADC_ISR_M_F_Pos                  (0)                                               /*!< ADC_T::ISR: M_F Position               */
#define ADC_ISR_M_F_Msk                  (0x1ul << ADC_ISR_M_F_Pos)                        /*!< ADC_T::ISR: M_F Mask                   */

#define ADC_ISR_PEDE_F_Pos               (2)                                               /*!< ADC_T::ISR: PEDE_F Position            */
#define ADC_ISR_PEDE_F_Msk               (0x1ul << ADC_ISR_PEDE_F_Pos)                     /*!< ADC_T::ISR: PEDE_F Mask                */

#define ADC_ISR_PEUE_F_Pos               (4)                                               /*!< ADC_T::ISR: PEUE_F Position            */
#define ADC_ISR_PEUE_F_Msk               (0x1ul << ADC_ISR_PEUE_F_Pos)                     /*!< ADC_T::ISR: PEUE_F Mask                */

#define ADC_ISR_T_F_Pos                  (8)                                               /*!< ADC_T::ISR: T_F Position               */
#define ADC_ISR_T_F_Msk                  (0x1ul << ADC_ISR_T_F_Pos)                        /*!< ADC_T::ISR: T_F Mask                   */

#define ADC_ISR_Z_F_Pos                  (9)                                               /*!< ADC_T::ISR: Z_F Position               */
#define ADC_ISR_Z_F_Msk                  (0x1ul << ADC_ISR_Z_F_Pos)                        /*!< ADC_T::ISR: Z_F Mask                   */

#define ADC_ISR_NAC_F_Pos                (10)                                              /*!< ADC_T::ISR: NAC_F Position             */
#define ADC_ISR_NAC_F_Msk                (0x1ul << ADC_ISR_NAC_F_Pos)                      /*!< ADC_T::ISR: NAC_F Mask                 */

#define ADC_ISR_INT_TC_Pos               (17)                                              /*!< ADC_T::ISR: INT_TC Position            */
#define ADC_ISR_INT_TC_Msk               (0x1ul << ADC_ISR_INT_TC_Pos)                     /*!< ADC_T::ISR: INT_TC Mask                */

