yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/adc_reg.h
#define ADC_WKISR_WPEDE_F_Pos            (1)                                               /*!< ADC_T::WKISR: WPEDE_F Position         */
#define ADC_WKISR_WPEDE_F_Msk            (0x1ul << ADC_WKISR_WPEDE_F_Pos)                  /*!< ADC_T::WKISR: WPEDE_F Mask             */

#define ADC_XYDATA_XDATA_Pos             (0)                                               /*!< ADC_T::XYDATA: XDATA Position          */
#define ADC_XYDATA_XDATA_Msk             (0xffful << ADC_XYDATA_XDATA_Pos)                 /*!< ADC_T::XYDATA: XDATA Mask              */

#define ADC_XYDATA_YDATA_Pos             (16)                                              /*!< ADC_T::XYDATA: YDATA Position          */
#define ADC_XYDATA_YDATA_Msk             (0xffful << ADC_XYDATA_YDATA_Pos)                 /*!< ADC_T::XYDATA: YDATA Mask              */

#define ADC_ZDATA_Z1DATA_Pos             (0)                                               /*!< ADC_T::ZDATA: Z1DATA Position          */
#define ADC_ZDATA_Z1DATA_Msk             (0xffful << ADC_ZDATA_Z1DATA_Pos)                 /*!< ADC_T::ZDATA: Z1DATA Mask              */

#define ADC_ZDATA_Z2DATA_Pos             (16)                                              /*!< ADC_T::ZDATA: Z2DATA Position          */
#define ADC_ZDATA_Z2DATA_Msk             (0x7fful << ADC_ZDATA_Z2DATA_Pos)                 /*!< ADC_T::ZDATA: Z2DATA Mask              */

#define ADC_DATA_ADC_DATA_Pos            (0)                                               /*!< ADC_T::DATA: ADC_DATA Position         */
#define ADC_DATA_ADC_DATA_Msk            (0xffful << ADC_DATA_ADC_DATA_Pos)                /*!< ADC_T::DATA: ADC_DATA Mask             */

#define ADC_XYSORT0_X_SORT0_Pos          (0)                                               /*!< ADC_T::XYSORT0: X_SORT0 Position       */
#define ADC_XYSORT0_X_SORT0_Msk          (0xffful << ADC_XYSORT0_X_SORT0_Pos)              /*!< ADC_T::XYSORT0: X_SORT0 Mask           */

#define ADC_XYSORT0_Y_SORT0_Pos          (16)                                              /*!< ADC_T::XYSORT0: Y_SORT0 Position       */
#define ADC_XYSORT0_Y_SORT0_Msk          (0xffful << ADC_XYSORT0_Y_SORT0_Pos)              /*!< ADC_T::XYSORT0: Y_SORT0 Mask           */

#define ADC_XYSORT1_X_SORT1_Pos          (0)                                               /*!< ADC_T::XYSORT1: X_SORT1 Position       */
#define ADC_XYSORT1_X_SORT1_Msk          (0xffful << ADC_XYSORT1_X_SORT1_Pos)              /*!< ADC_T::XYSORT1: X_SORT1 Mask           */

#define ADC_XYSORT1_Y_SORT1_Pos          (16)                                              /*!< ADC_T::XYSORT1: Y_SORT1 Position       */
#define ADC_XYSORT1_Y_SORT1_Msk          (0xffful << ADC_XYSORT1_Y_SORT1_Pos)              /*!< ADC_T::XYSORT1: Y_SORT1 Mask           */

#define ADC_XYSORT2_X_SORT2_Pos          (0)                                               /*!< ADC_T::XYSORT2: X_SORT2 Position       */
#define ADC_XYSORT2_X_SORT2_Msk          (0xffful << ADC_XYSORT2_X_SORT2_Pos)              /*!< ADC_T::XYSORT2: X_SORT2 Mask           */

#define ADC_XYSORT2_Y_SORT2_Pos          (16)                                              /*!< ADC_T::XYSORT2: Y_SORT2 Position       */
#define ADC_XYSORT2_Y_SORT2_Msk          (0xffful << ADC_XYSORT2_Y_SORT2_Pos)              /*!< ADC_T::XYSORT2: Y_SORT2 Mask           */

#define ADC_XYSORT3_X_SORT3_Pos          (0)                                               /*!< ADC_T::XYSORT3: X_SORT3 Position       */
#define ADC_XYSORT3_X_SORT3_Msk          (0xffful << ADC_XYSORT3_X_SORT3_Pos)              /*!< ADC_T::XYSORT3: X_SORT3 Mask           */

#define ADC_XYSORT3_Y_SORT3_Pos          (16)                                              /*!< ADC_T::XYSORT3: Y_SORT3 Position       */
#define ADC_XYSORT3_Y_SORT3_Msk          (0xffful << ADC_XYSORT3_Y_SORT3_Pos)              /*!< ADC_T::XYSORT3: Y_SORT3 Mask           */

#define ADC_ZSORT0_Z1_SORT0_Pos          (0)                                               /*!< ADC_T::ZSORT0: Z1_SORT0 Position       */
#define ADC_ZSORT0_Z1_SORT0_Msk          (0xffful << ADC_ZSORT0_Z1_SORT0_Pos)              /*!< ADC_T::ZSORT0: Z1_SORT0 Mask           */

#define ADC_ZSORT0_Z2_SORT0_Pos          (16)                                              /*!< ADC_T::ZSORT0: Z2_SORT0 Position       */
#define ADC_ZSORT0_Z2_SORT0_Msk          (0xffful << ADC_ZSORT0_Z2_SORT0_Pos)              /*!< ADC_T::ZSORT0: Z2_SORT0 Mask           */

#define ADC_ZSORT1_Z1_SORT1_Pos          (0)                                               /*!< ADC_T::ZSORT1: Z1_SORT1 Position       */
#define ADC_ZSORT1_Z1_SORT1_Msk          (0xffful << ADC_ZSORT1_Z1_SORT1_Pos)              /*!< ADC_T::ZSORT1: Z1_SORT1 Mask           */

#define ADC_ZSORT1_Z2_SORT1_Pos          (16)                                              /*!< ADC_T::ZSORT1: Z2_SORT1 Position       */
#define ADC_ZSORT1_Z2_SORT1_Msk          (0xffful << ADC_ZSORT1_Z2_SORT1_Pos)              /*!< ADC_T::ZSORT1: Z2_SORT1 Mask           */

#define ADC_ZSORT2_Z1_SORT2_Pos          (0)                                               /*!< ADC_T::ZSORT2: Z1_SORT2 Position       */
#define ADC_ZSORT2_Z1_SORT2_Msk          (0xffful << ADC_ZSORT2_Z1_SORT2_Pos)              /*!< ADC_T::ZSORT2: Z1_SORT2 Mask           */

#define ADC_ZSORT2_Z2_SORT2_Pos          (16)                                              /*!< ADC_T::ZSORT2: Z2_SORT2 Position       */
#define ADC_ZSORT2_Z2_SORT2_Msk          (0xffful << ADC_ZSORT2_Z2_SORT2_Pos)              /*!< ADC_T::ZSORT2: Z2_SORT2 Mask           */

#define ADC_ZSORT3_Z1_SORT3_Pos          (0)                                               /*!< ADC_T::ZSORT3: Z1_SORT3 Position       */
#define ADC_ZSORT3_Z1_SORT3_Msk          (0xffful << ADC_ZSORT3_Z1_SORT3_Pos)              /*!< ADC_T::ZSORT3: Z1_SORT3 Mask           */

#define ADC_ZSORT3_Z2_SORT3_Pos          (16)                                              /*!< ADC_T::ZSORT3: Z2_SORT3 Position       */
#define ADC_ZSORT3_Z2_SORT3_Msk          (0xffful << ADC_ZSORT3_Z2_SORT3_Pos)              /*!< ADC_T::ZSORT3: Z2_SORT3 Mask           */

#ifdef __cplusplus
}
#endif

#endif

/**@}*/ /* ADC_CONST */
/**@}*/ /* end of ADC register group */


/**@}*/ /* end of REGISTER group */

/*** (C) COPYRIGHT 2025 Nuvoton Technology Corp. ***/
